# Creating Data Tables in Python

We will use the largest companies data set to look at creating tables in Python with Pandas

Data tables such as summaries, pivot tables and cross tables are also useful ways to present or summarize data analysis

Pandas has tools to let us do this

# Slicing and sorting data

In working with tabular data, we may want to extract, structure and order parts of it, so we can

    -make data tables of it

    -make visualizations to answer specific questions

    -get ready to create models or carry out other tasks

There are some specific operations we will want to do

Select- choose specific columns

Filter- choose only specific rows,  often based on some condition (eg Sales>1000) or (Country equal Bolivia)

Sort-  Order the data using some column from high to low, or low to high

Group-  We might want to group data by categorical variables (country for example)

Calculate-  We might want to calculate values, particularly after grouping,   to find the mean Sales of companies grouped by Country

We will look at how to do this in Pandas, and then how to combine the operations to create useful tables, or graphics

## Set up libraries and load the data

In [1]:
import pandas as pd
import numpy as np

import matplotlib.pyplot as plt
import os

In [2]:
# set up a file browswer to locate the data file
#  Largest-Companies.csv


import tkinter as tk
from tkinter import filedialog
 
root = tk.Tk()
root.withdraw()
file_path = filedialog.askopenfilename()

infile=file_path

print(infile)

G:/My Drive/DSE5002_Version_2/DataSet_Example_Largest_companies/Largest-Companies.csv

In [3]:
# Load the data set into a pandas data frame call lcdf  (large company data frame)

lcdf=pd.read_csv(infile,encoding="latin1")

In [4]:
lcdf.head()

,Rank,Name,Sales,Profit,Assets,Market Value,Industry,Founded,Headquarters,Country,CEO,Employees
0,1,JPMorgan Chase,252.9,50.0,4090.7,588.1,Banking and Financial Services,2000.0,New York- New York,United States,Jamie Dimon,186751.0
1,2,Berkshire Hathaway,369.0,73.4,1070.0,899.1,Conglomerate,1839.0,Omaha- Nebraska,United States,Warren Edward Buffett,396500.0
2,3,Saudi Arabian Oil Company (Saudi Aramco),489.1,116.9,661.5,1919.3,Construction- Chemicals- Raw Materials,1933.0,Dhahran,Saudi Arabia,Amin bin Hasan Al-Nasser,70000.0
3,4,ICBC,223.8,50.4,6586.0,215.2,Banking and Financial Services,1984.0,Beijing,China,Wang Jingwu,427587.0
4,5,Bank of America,183.3,25.0,3273.8,307.3,Banking and Financial Services,1904.0,Charlotte- North Carolina,United States,Brian T. Moynihan,166140.0

# Selecting one or more columns

We can

-select columns by name, or by a list of names

-select columns by number, or lists of numbers using the .iloc() member function

-select columns using names, with the

In [5]:
# one column by name

lcdf.Sales

0       252.900
1       369.000
2       489.100
3       223.800
4       183.300
         ...
1996      0.201
1997      3.900
1998     15.200
1999      2.200
2000      5.100
Name: Sales, Length: 2001, dtype: float64

In [7]:
# or

lcdf['Sales']

0       252.900
1       369.000
2       489.100
3       223.800
4       183.300
         ...
1996      0.201
1997      3.900
1998     15.200
1999      2.200
2000      5.100
Name: Sales, Length: 2001, dtype: float64

In [19]:
# we can select a list of names

tempdf=lcdf[['Name','Sales',"CEO"]]

tempdf

,Name,Sales,CEO
0,JPMorgan Chase,252.900,Jamie Dimon
1,Berkshire Hathaway,369.000,Warren Edward Buffett
2,Saudi Arabian Oil Company (Saudi Aramco),489.100,Amin bin Hasan Al-Nasser
3,ICBC,223.800,Wang Jingwu
4,Bank of America,183.300,Brian T. Moynihan
...,...,...,...
1996,Sichuan Chuantou Energy,0.201,Hong Yang
1997,Vietnam Prosperity Joint-sock Commercial Bank,3.900,Vinh Duc Nguyen
1998,Adient,15.200,Jerome Dorlack MBA
1999,CapitaLand Investment,2.200,Chee Koon Lee
2000,Shanxi Lu'an Environmental,5.100,Hong Miao Shi

In [20]:
# we can add .head() to the end of these to limit how many we see at once

tempdf=lcdf[['Name','Sales',"CEO"]]

tempdf.head()

                                       Name  Sales                       CEO
0                            JPMorgan Chase  252.9               Jamie Dimon
1                        Berkshire Hathaway  369.0     Warren Edward Buffett
2  Saudi Arabian Oil Company (Saudi Aramco)  489.1  Amin bin Hasan Al-Nasser
3                                      ICBC  223.8               Wang Jingwu
4                           Bank of America  183.3         Brian T. Moynihan

In [21]:
#selecting by number using .iloc

#.iloc stands for integer location, we specify a set of rows, then a set of columns

# the command below is the rows 0,1,2,3,4 and column 1

temp_df=lcdf.iloc[0:5,1]

temp_df

0                              JPMorgan Chase
1                          Berkshire Hathaway
2    Saudi Arabian Oil Company (Saudi Aramco)
3                                        ICBC
4                             Bank of America
Name: Name, dtype: object

In [24]:
#selecting by number using .loc

#.loc selects by lists of rownames and list of column names
# this data set has no rownames in it,  so we set the row value to :, to get all rows

# the command gives us all rows Name and Country columsn

temp_df=lcdf.loc[ :,["Name","Country"]]

temp_df

                                               Name        Country
0                                    JPMorgan Chase  United States
1                                Berkshire Hathaway  United States
2          Saudi Arabian Oil Company (Saudi Aramco)   Saudi Arabia
3                                              ICBC          China
4                                   Bank of America  United States
...                                             ...            ...
1996                        Sichuan Chuantou Energy          China
1997  Vietnam Prosperity Joint-sock Commercial Bank        Vietnam
1998                                         Adient  United States
1999                          CapitaLand Investment      Singapore
2000                     Shanxi Lu'an Environmental          China

[2001 rows x 2 columns]

In [75]:
## combining loc and iloc

temp_df=lcdf.loc[ :,["Name","Country"]].iloc[0:10,:]

temp_df

                                       Name        Country
0                            JPMorgan Chase  United States
1                        Berkshire Hathaway  United States
2  Saudi Arabian Oil Company (Saudi Aramco)   Saudi Arabia
3                                      ICBC          China
4                           Bank of America  United States
5                                    Amazon  United States
6                   China Construction Bank          China
7                                 Microsoft  United States
8                Agricultural Bank of China          China
9                                  Alphabet  United States

# Filtering to get only specific rows

Filtering is to obtain a number of columns but limit the rows to those that meet a condition

the command

lcdf[ (lcdf["Sales"}>100) ]

checks the values of lcdf["Sales"] for each row and filters the result to the case where "Sales" is greater than 100

In [18]:
# here is what it looks like

lcdf[lcdf['Sales']>100].loc[:,["Name","CEO","Country"]]

0                                JPMorgan Chase
1                            Berkshire Hathaway
2      Saudi Arabian Oil Company (Saudi Aramco)
3                                          ICBC
4                               Bank of America
                         ...
364                                 Freddie Mac
366           China Communications Construction
554                                  Xiamen C&D
585                             Cardinal Health
688                    Walgreens Boots Alliance
Name: Name, Length: 80, dtype: object

## Comparison Operations

There are a number of operations we can using in a filtering operation

Comparisons

>
<
>=
<=
~= not equal
== equal

Combining comparisons

NOT    ~(lcdf["Sales"}>100)     -cases where sales are not greater than 100

& AND  - two conditions must be met

         (lcdf["Sales"}>100) AND (lcdf["Country"]=="Brazil")

         would select companies from From Brazil with Sales over 100

| OR- returns cases when either condition is true

        (lcdf["Country"]=="Brazil") OR  (lcdf["Country"]=="Argentina")

        would give us all companies from Brazil or from Argentina

In [26]:
# sales not greater than 100

lcdf[~(lcdf['Sales']>100)].loc[:,["Name","CEO","Country"]]

,Name,CEO,Country
25,Morgan Stanley,Edward N. Pick,United States
26,RBC,David Ian McKay,Canada
33,China Merchants Bank,Liang Wang,China
34,UBS,Sergio P. Ermotti,Switzerland
37,Tencent Holdings,Hua Teng Ma,China
...,...,...,...
1996,Sichuan Chuantou Energy,Hong Yang,China
1997,Vietnam Prosperity Joint-sock Commercial Bank,Vinh Duc Nguyen,Vietnam
1998,Adient,Jerome Dorlack MBA,United States
1999,CapitaLand Investment,Chee Koon Lee,Singapore
2000,Shanxi Lu'an Environmental,Hong Miao Shi,China

In [29]:
lcdf[(lcdf['Country']=="Brazil")|(lcdf["Country"]=="Mexico")].loc[:,["Name","CEO","Country"]]

,Name,CEO,Country
53,Petrobras,Magda Chambriard,Brazil
86,Ita? Unibanco Holding,Milton Maluhy Filho,Brazil
159,Banco do Brasil,Tarciana Paula Gomes Medeiros,Brazil
181,Vale,Eduardo De Salles Bartolomeo,Brazil
207,América Móvil,Daniel Hajj Aboumrad,Mexico
222,Banco Bradesco,Marcelo de Ara?jo Noronha,Brazil
268,Banorte,Jose Marcos RamÃ­rez Miguel,Mexico
301,Banco Btg Pactual,Roberto Balls Sallouti,Brazil
398,Femsa,JosÃ© Antonio FernÃ¡ndez Carbajal,Mexico
450,Grupo Mexico,GermÃ¡n Larrea Mota-Velasco,Mexico
773,Grupo Inbursa,Javier Foncerrada Izquierdo,Mexico
807,Grupo Bimbo,Rafael Pamias,Mexico
830,JBS,Gilberto Tomazoni,Brazil
849,Eletrobrás,Ivan de Souza Monteiro,Brazil
910,Suzano,Walter Schalka,Brazil
950,Raizen,Ricardo Dell Aquila Mussa,Brazil
955,Itaúsa,97000,Brazil
1066,Arca Continental,Arturo GutiÃ©rrez HernÃ¡ndez,Mexico
1095,Grupo Carso,Antonio GÃ³mez Garcia,Mexico
1105,WEG,Alberto Yoshikazu Kuba,Brazil
1129,El Puerto de Liverpool,Graciano Francisco Guichard Gonzlez,Mexico
1132,Vibra Energia,Ernesto Peres Pousada,Brazil
1144,XP,Thiago Maffra,Brazil
1151,Cemex,Fernando Angel GonzÃ¡lez Olivieri,Mexico
1223,Gerdau (Cosigua),Gustavo Werneck da Cunha,Brazil
1294,Marfrig Global Foods,Rui MendonÃ§a,Brazil
1350,Rede D'Oro Luiz,Paulo Junqueira Moll,Brazil
1353,Grupo Elektra,Ricardo BenjamÃ­n Salinas,Mexico
1476,Ultrapar Participacoes,Marcos Marinho Lutz,Brazil
1519,CPFL Energia,Gustavo Estrella,Brazil
1651,Companhia Energetica de Minas Gerais,Reynaldo Passanezi Filho,Brazil
1657,B3,Gilson Finkelsztain,Brazil
1726,Braskem,Roberto Bischoff,Brazil
1796,Grupo Comercial Chedraui SAB de CV Class B,JosÃ© Antonio Chedraui EguÃ­a,Mexico
1801,Fibra Uno,AndrÃ© El-Mann Arazi,Mexico
1826,Cosan,Nelson Roseira Gomes,Brazil
1832,Metalurgica Gerdau,Gustavo Werneck da Cunha,Brazil
1914,Sabesp,AndrÃ© Mendes,Brazil
1931,ALFA,Ãlvaro FernÃ¡ndez Garza,Mexico
1983,Equatorial Energia,Augusto Miranda da Paz,Brazil

In [31]:
# country is Brazil and sales >50
lcdf[(lcdf['Country']=="Brazil")&(lcdf["Sales"]>50)].loc[:,["Name","CEO","Country"]]

                      Name                            CEO Country
53               Petrobras               Magda Chambriard  Brazil
86   Ita? Unibanco Holding            Milton Maluhy Filho  Brazil
159        Banco do Brasil  Tarciana Paula Gomes Medeiros  Brazil
222         Banco Bradesco      Marcelo de Ara?jo Noronha  Brazil
830                    JBS              Gilberto Tomazoni  Brazil

# Calculating values

We can calculate means or other functions across a dataframe

In [33]:
lcdf[["Profit","Sales","Market Value","Assets"]].apply("mean")

Profit            2.248652
Sales            25.838675
Market Value     44.204768
Assets          119.091304
dtype: float64

In [35]:
# we can use multiple functions, by putting them in a list

lcdf[["Profit","Sales","Market Value","Assets"]].apply(["mean","median","min","max"])

            Profit       Sales  Market Value       Assets
mean      2.248652   25.838675     44.204768   119.091304
median    0.931000   12.700000     17.400000    33.600000
min     -17.900000    0.123000      0.007000     1.300000
max     116.900000  657.300000   3123.100000  6586.000000

# Groupby

The functions become more useful when we can group data by categories

Here we will group by country and then calculate the mean sales and market value

In [41]:
lcdf[["Country","Sales","Market Value"]].groupby(["Country"]).apply("mean")

                          Sales  Market Value
Country
Argentina             17.766667     35.566667
Australia             17.350719     34.784375
Austria               17.000000     10.788889
Belgium               17.466667     25.911111
Bermuda               12.137500     12.275000
Brazil                25.742308     21.246154
Canada                21.520339     34.900000
Cayman Islands         8.100000     55.600000
Chile                 14.228571      7.485714
China                 28.892050     23.463926
Colombia              11.828571      7.157143
Croatia                5.400000      0.746500
Cyprus                 1.500000      2.100000
Czech Republic        15.300000     21.600000
Denmark               14.746154     64.907692
Egypt                  4.700000      4.800000
Finland               15.333333     20.588889
France                41.046000     57.640000
Germany               45.978000     34.499380
Greece                 7.900000      4.701125
Hong Kong             14.575357     17.131929
Hungary               13.666667      8.633333
India                 17.880100     34.270000
Indonesia              6.966667     36.855556
Ireland               18.733333     54.404762
Israel                 6.825000      8.866667
Italy                 19.400000     22.092857
Japan                 23.695265     22.444657
Jordan                 2.900000      3.900000
Kazakhstan             4.850000     14.100000
Kuwait                 8.550000     32.250000
Luxembourg            33.666667     16.800000
Malaysia               6.622222     11.366667
Mexico                18.328571     22.278571
Morocco                3.550000      8.150000
Netherlands           24.407440     40.468000
Nigeria                2.800000      0.595500
Norway                22.437500     21.187500
Oman                   2.200000      5.100000
Peru                   7.000000     13.000000
Philippines            9.850000      8.564333
Poland                27.600000     11.200000
Portugal              19.925000     13.350000
Qatar                  8.083333     14.400000
Romania                2.900000      5.200000
Saudi Arabia          38.000000    151.025000
Singapore             20.140000     25.270000
Slovenia               1.600000      2.500000
South Africa           9.150000     12.066667
South Korea           27.101639     16.609180
Spain                 30.440000     32.650000
Sweden                12.962963     26.581481
Switzerland           23.943870     43.611130
Taiwan                18.543902     31.808512
Thailand              15.831250     10.300000
Turkey                22.300000      9.680000
United Arab Emirates  10.633333     43.733333
United Kingdom        30.970169     43.364615
United States         30.159303     77.460581
Vietnam                4.571429      8.614286

In [43]:
### Count is very handy way to make a table of counts

lcdf[["Country","Headquarters"]].groupby(["Country"]).apply("count")

                      Headquarters
Country
Argentina                        3
Australia                       32
Austria                          9
Belgium                          9
Bermuda                          8
Brazil                          26
Canada                          59
Cayman Islands                   1
Chile                            7
China                          280
Colombia                         7
Croatia                          0
Cyprus                           1
Czech Republic                   1
Denmark                         13
Egypt                            1
Finland                          9
France                          50
Germany                         50
Greece                           8
Hong Kong                       42
Hungary                          2
India                           69
Indonesia                        9
Ireland                         21
Israel                          12
Italy                           28
Japan                          181
Jordan                           1
Kazakhstan                       2
Kuwait                           2
Luxembourg                       3
Malaysia                         9
Mexico                          14
Morocco                          2
Netherlands                     25
Nigeria                          2
Norway                           8
Oman                             1
Peru                             1
Philippines                      6
Poland                           5
Portugal                         4
Qatar                            6
Romania                          1
Saudi Arabia                    16
Singapore                       10
Slovenia                         1
South Africa                    12
South Korea                     61
Spain                           20
Sweden                          26
Switzerland                     44
Taiwan                          41
Thailand                        16
Turkey                          10
United Arab Emirates            12
United Kingdom                  64
United States                  621
Vietnam                          7

In [45]:
#We can use multiple groupings, say Country and Headquarters

lcdf[["Country","Headquarters","CEO"]].groupby(["Country","Headquarters"]).apply("count")

                                        CEO
Country       Headquarters
Argentina     Buenos Aires                2
              Montevideo                  1
Australia     Adelaide                    1
              Alexandria                  1
              Bella Vista                 1
...                                     ...
United States Woonsocket- Rhode Island    1
              Wyomissing- Pennsylvania    1
Vietnam       Ha Noi                      4
              Hanoi                       2
              Ho Chi Minh City            1

[714 rows x 1 columns]

In [49]:
# We could limit this to the US and count headquarters

lcdf[ lcdf["Country"]=="United States"].loc[:,["Headquarters","CEO"]].groupby(["Headquarters"]).apply("count")

                          CEO
Headquarters
 California                 1
Abbott Park- Illinois       1
Akron- Ohio                 2
Allentown- Pennsylvania     2
Ankeny- Iowa                1
...                       ...
Windsor- Connecticut        1
Winona- Minnesota           1
Winter Haven- Florida       1
Woonsocket- Rhode Island    1
Wyomissing- Pennsylvania    1

[277 rows x 1 columns]

# Ordering or Sorting

It would be nice to order the results, this is a sort operation

In [52]:
lcdf.sort_values("Headquarters")

,Rank,Name,Sales,Profit,Assets,Market Value,Industry,Founded,Headquarters,Country,CEO,Employees
1332,1333,Robinhood Markets,2.100,0.1270,46.1,17.7,IT Software & Services,2013.0,California,United States,Vladimir Tenev,2200.0
250,251,Inditex,38.900,5.8000,35.6,146.1,Retail and Wholesale,1985.0,A CoruÃ±a,Spain,Oscar GarcÃ­a Maceiras,161281.0
972,973,Vestas Wind Systems,16.500,-0.0064,24.4,28.2,Engineering- Manufacturing,1945.0,Aarhus,Denmark,Henrik Andersen,29000.0
162,163,Abbott Laboratories,40.300,5.6000,72.5,181.1,Medical Devices & Products,1888.0,Abbott Park- Illinois,United States,Robert B. Ford,115000.0
1001,1002,Abu Dhabi Islamic Bank,3.900,1.4000,53.0,11.8,Banking,1997.0,Abu Dhabi,United Arab Emirates,Nasser Al Awadhi,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
1447,1448,SSAB,10.800,1.1000,10.6,5.7,Iron & Steel,1978.0,NaN,Sweden,Martin Lindqvist,14235.0
1603,1604,Jio Financial Services,0.224,0.1938,17.4,27.2,Diversified Financials,1999.0,NaN,India,Hitesh Kumar Sethia,NaN
1686,1687,Seres Group,7.800,-0.2238,8.7,18.4,Consumer Durables,1986.0,NaN,China,Zheng Ping Zhang,16102.0
1791,1792,Adris grupa d.d. Pref.,8.300,0.4458,23.6,1.0,Insurance,1872.0,NaN,Croatia,Marko Remenar,7278.0
1870,1871,MBH Bank Plc.,3.900,0.5190,32.1,6.8,Banking,1950.0,NaN,Hungary,Zsolt Barna,NaN

In [53]:
# Reverse sort

lcdf.sort_values("Sales",ascending=False)

,Rank,Name,Sales,Profit,Assets,Market Value,Industry,Founded,Headquarters,Country,CEO,Employees
19,20,Walmart,657.300,18.9000,254.1,521.1,Pharmacies,1962.0,Bentonville- Arkansas,United States,C. Douglas McMillon,1600000.0
5,6,Amazon,590.700,37.7000,531.0,1922.1,Retail and Wholesale,1994.0,Seattle- Washington,United States,Andrew R. Jassy,1525000.0
2,3,Saudi Arabian Oil Company (Saudi Aramco),489.100,116.9000,661.5,1919.3,Construction- Chemicals- Raw Materials,1933.0,Dhahran,Saudi Arabia,Amin bin Hasan Al-Nasser,70000.0
41,42,Sinopec,414.900,8.5000,289.7,106.8,Construction- Chemicals- Raw Materials,2000.0,Beijing,China,Zhao Dong,374791.0
17,18,PetroChina,399.100,22.7000,388.1,177.6,Oil & Gas Operations,1999.0,Beijing,China,Yi Lin Wang,375803.0
...,...,...,...,...,...,...,...,...,...,...,...,...
1603,1604,Jio Financial Services,0.224,0.1938,17.4,27.2,Diversified Financials,1999.0,NaN,India,Hitesh Kumar Sethia,NaN
1703,1704,Bajaj Holdings & Investment,0.207,0.8778,7.8,11.0,Diversified Financials,1926.0,Pune,India,Sanjivnayan Rahul K. Bajaj,17.0
1996,1997,Sichuan Chuantou Energy,0.201,0.6327,8.6,11.3,Utilities,2001.0,Chengdu,China,Hong Yang,1453.0
1660,1661,Power Assets Holdings,0.165,0.7668,12.3,12.8,Utilities,1889.0,Hong Kong,Hong Kong,Chao Chung Tsai,13.0
1377,1378,Roivant Sciences,0.123,4.5000,7.3,9.1,Drugs & Biotechnology,2014.0,NaN,United Kingdom,Matthew Gline,904.0

# Making interesting tables

In [56]:
# combining a sort, groupby and an applied function lets us make some nice tables

# We could limit this to the US and count headquarters

lcdf[ lcdf["Country"]=="United States"].loc[:,["Headquarters","CEO"]].groupby(["Headquarters"]).apply("count").sort_values("CEO",ascending=False)

                           CEO
Headquarters
New York- New York          56
Houston- Texas              21
Chicago- Illinois           19
San Francisco- California   16
Atlanta- Georgia            14
...                        ...
Kansas City- Missouri        1
Kenilworth- New Jersey       1
Kenosha- Wisconsin           1
Wyomissing- Pennsylvania     1
Round Rock- Texas            0

[277 rows x 1 columns]

In [59]:
# we could look at Market value by city
lcdf[ lcdf["Country"]=="United States"].loc[:,["Headquarters","Market Value"]].groupby(["Headquarters"]).apply("mean").sort_values("Market Value",ascending=False)

                            Market Value
Headquarters
Redmond- Washington               3123.1
Cupertino- California             2911.5
Menlo Park- California            1197.0
Mountain View- California         1181.4
Omaha- Nebraska                    524.3
...                                  ...
District of Columbia                 2.9
Menomonee Falls- Wisconsin           2.9
Plymouth- Michigan                   2.6
Monroe- Louisiana                    1.3
Long Island City- New York           1.0

[277 rows x 1 columns]

In [62]:
# statistics for US companies only

lcdf[ lcdf["Country"]=="United States"].loc[:,["Profit","Sales","Market Value","Assets"]].apply(["mean","median","min","max","count"])

            Profit       Sales  Market Value       Assets
mean      2.844898   30.159303     77.460581    96.513205
median    1.000000   12.400000     26.100000    25.700000
min     -10.800000    0.490000      0.007000     1.600000
max     100.400000  657.300000   3123.100000  4323.800000
count   621.000000  621.000000    621.000000   621.000000

In [67]:
#Statistics for US countries only, grouped by headquarters locations

lcdf[ lcdf["Country"]=="United States"].loc[:,["Headquarters","Profit","Sales","Market Value","Assets"]].groupby(["Headquarters"]).apply("mean")

                          Profit  Sales  Market Value  Assets
Headquarters
 California               0.1270    2.1         17.70   46.10
Abbott Park- Illinois     5.6000   40.3        181.10   72.50
Akron- Ohio               0.2275   16.3         13.35   36.65
Allentown- Pennsylvania   1.6310   10.2         40.10   37.75
Ankeny- Iowa              0.4710   14.6         12.40    6.20
...                          ...    ...           ...     ...
Windsor- Connecticut      0.6387    5.6         15.80   17.40
Winona- Minnesota         1.2000    7.4         38.00    4.50
Winter Haven- Florida     0.4694    2.3          6.20   45.10
Woonsocket- Rhode Island  7.3000  361.3         72.40  249.70
Wyomissing- Pennsylvania  0.7250    1.5         12.50   11.80

[277 rows x 4 columns]

# More Advanced Tables in Pandas

These tables are for situations where you have multiple factors,  rather than just the two factors in this data set


## Pivot Tables

https://pandas.pydata.org/docs/reference/api/pandas.pivot_table.html

## Cross Tables

https://pandas.pydata.org/docs/reference/api/pandas.crosstab.html

In [ ]:
##Pivot Table Example

In [68]:
#Set up an example data frame with three factors A, B,C and two floating point values

df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",
                          "bar", "bar", "bar", "bar"],
                    "B": ["one", "one", "one", "two", "two",
                          "one", "one", "two", "two"],
                    "C": ["small", "large", "large", "small",
                          "small", "large", "small", "small",
                          "large"],
                    "D": [1, 2, 2, 3, 3, 4, 5, 6, 7],
                   "E": [2, 4, 5, 5, 6, 6, 8, 9, 9]})
df

     A    B      C  D  E
0  foo  one  small  1  2
1  foo  one  large  2  4
2  foo  one  large  2  5
3  foo  two  small  3  5
4  foo  two  small  3  6
5  bar  one  large  4  6
6  bar  one  small  5  8
7  bar  two  small  6  9
8  bar  two  large  7  9

In [70]:
# Create a pivot table, the grouping along rows is by the combination of A and B,  while the column is C
# the function used is the sum of values within the combination

table = pd.pivot_table(df, values='D', index=['A', 'B'],
                       columns=['C'], aggfunc="sum")
table

C        large  small
A   B
bar one    4.0    5.0
    two    7.0    6.0
foo one    4.0    1.0
    two    NaN    6.0

In [71]:
# just change this a bit, lets use A as the index and B,C as the column, and show the median

table = pd.pivot_table(df, values='D', index=['A'],
                       columns=['B','C'], aggfunc="median")
table

B     one         two
C   large small large small
A
bar   4.0   5.0   7.0   6.0
foo   2.0   1.0   NaN   3.0

## Cross Table

Shows the count in each combination of factors

Note the inputs here are just np arrays, we could pass in columns of a data frame

In [72]:
a = np.array(["foo", "foo", "foo", "foo", "bar", "bar",
              "bar", "bar", "foo", "foo", "foo"], dtype=object)
b = np.array(["one", "one", "one", "two", "one", "one",
              "one", "two", "two", "two", "one"], dtype=object)
c = np.array(["dull", "dull", "shiny", "dull", "dull", "shiny",
              "shiny", "dull", "shiny", "shiny", "shiny"],
             dtype=object)
pd.crosstab(a, [b, c], rownames=['a'], colnames=['b', 'c'])

b    one        two
c   dull shiny dull shiny
a
bar    1     2    1     0
foo    2     2    1     2

In [74]:
# Here is a crosstable based on the data set df used in the Pivot Table Example

pd.crosstab(df.A,[df.B,df.C], rownames=['A'],colnames=['A','B'])

A     one         two
B   large small large small
A
bar     1     1     1     1
foo     2     1     0     2